#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teste-carla/novo-workspace/runs/run-h5HJ5RRqCvY9bU8f

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
aws_eks_cluster.tech: Refreshing state... [id=tech]
aws_eks_node_group.techNode: Refreshing state... [id=tech:techNode]
aws_eks_cluster.tech: Drift detected (update)
aws_eks_node_group.techNode: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_integration.proxy will be created
  + resource "aws_api_gateway_integration" "proxy" {
      + cache_namespace         = (known after apply)
      + connection_id           = (known after apply)
      + connection_type         = "VPC_LINK"
      + content_handling        = "CONVERT_TO_TEXT"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = "WHEN_NO_MATCH"
      + request_parameters      = {
          + "integration.request.header.Accept"        = "'application/json'"
          + "integration.request.header.Authorization" = "method.request.header.Authorization"
          + "integration.request.path.proxy"           = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://a480f7cbcbf6d4e75b24e396b405d92d/{proxy}"
    }

  # aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Authorization" = true
          + "method.request.path.proxy"           = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Foobar Gateway VPC Link. Managed by Terraform."
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "tech_gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_vpc_link.main will be created
  + resource "aws_api_gateway_vpc_link" "main" {
      + arn         = (known after apply)
      + description = "Foobar Gateway VPC Link. Managed by Terraform."
      + id          = (known after apply)
      + name        = "tech_vpclink"
      + tags_all    = (known after apply)
      + target_arns = [
          + "arn:aws:elasticloadbalancing:us-east-1:019248244455:loadbalancer/net/a480f7cbcbf6d4e75b24e396b405d92d/758428d38787cf25",
        ]
    }

  # aws_eks_cluster.tech will be destroyed
  - resource "aws_eks_cluster" "tech" {
      - arn                   = "arn:aws:eks:us-east-1:019248244455:cluster/tech" -> null
      - certificate_authority = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJUm5EWmtpdHNkbkl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1Ua3hOelEzTWpCYUZ3MHpOREE1TVRjeE56VXlNakJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUREekNDejg2M0g4MG1FaU0vbURTVEhKa0VxTTl4VTVTNzhqUXRqUThocDNxWk1tMndpbTNoZVFPZFIKdnltOGZMaFlWRE9UM1dzWUVwVWI0aTFraHZOZ3Q3dlYxcDAwZUVNUERSOGdFRDlBYzh4THhBM1lpZDRpaGhaMwpIWWxHRHBYMTFKYVA1ZEtBT0RqWjh4RmxKM1VLSHNXTVZRdnlsYVRTRlRHcjE2ZHZhZ0tQc1pYWFB5TTIwZWp5ClZCLzJhMDZRL3JiaFpOSjNpQjU1QVlmT2FMVU9lM2pkREZmZWh1eVJUeGxVdEEwUEJuMDJuVjFHQVVrZEd4RVoKcmxmYkcrakljRmRFYkxJTm5iVXJMSVBmZDhHMDIrWWpWeTFVTEFycStZdFVvRWpzQ2VkRlFTNndhZjVJbENVRAovVFNSdmcvWlNCUDBzWTEvZlA3OHpRNW1BZldiQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUeFhSQXlhSlpsVC9UR25IbmZoQWdNMHFPUEpUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUF3SEg5dmNiWgpYMUw5V0VGTHdZSndjMkxPZlQ0eWxoZG1jcktEQ2Z3MFgrdk1FbnlDQVh6VXZjZU0vMEs2dXd3Z2xiSmJsQTN5CjRwb1d5dDF0Sk5Lek8wWllPZ3kycENlcndwUXc5ZG5wNXJMM0xVUm1QU2IvVE5Ua2RWdG1CU0F0WnVrRkJteVoKcmZZWFB3bnYyckhXSjhsRFhXNnR4UzdqOThIWmk2VUVPNm1oakVGMlFuMmdBNUhsQ3c2MmJVQ2ZSTE55RFVlOAprV2d2Y0t5RUV4UFNOalg2c0hrY0VjaHRBTUhxa3ljczhpN2ozcm9ySTZvZTR0bFdWNEVOdEl2R2lsbC9xTXljCjNCTk9yVXpjQVFNdGxOWnpXZnV0SlR0aVkxNk1JWWwrY01hYUVCOHRIc1M1ZXk0VENsdWdlQXVkOG1wOEtZaG8KUFFtOUwrc2xLeDQrCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - created_at            = "2024-09-19 17:48:08.152 +0000 UTC" -> null
      - endpoint              = "https://B453925D5B10C5E4DA8B23A7CC148248.gr7.us-east-1.eks.amazonaws.com" -> null
      - id                    = "tech" -> null
      - identity              = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/B453925D5B10C5E4DA8B23A7CC148248"
                    },
                ]
            },
        ] -> null
      - name                  = "tech" -> null
      - platform_version      = "eks.8" -> null
      - role_arn              = "arn:aws:iam::019248244455:role/LabRole" -> null
      - status                = "ACTIVE" -> null
      - tags_all              = {} -> null
      - version               = "1.30" -> null

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "10.100.0.0/16" -> null
            # (1 unchanged attribute hidden)
        }

      - vpc_config {
          - cluster_security_group_id = "sg-04e1b692d3ef0a508" -> null
          - endpoint_private_access   = false -> null
          - endpoint_public_access    = true -> null
          - public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> null
          - subnet_ids                = [
              - "subnet-01d3059e23aa6d6d7",
              - "subnet-023821714e99975f0",
              - "subnet-04a1a10cbf10df2bb",
              - "subnet-057bd241945828c79",
              - "subnet-067058a4f0e40dbdd",
            ] -> null
          - vpc_id                    = "vpc-00edc17219c9cffdf" -> null
        }
    }

  # aws_eks_node_group.techNode will be destroyed
  - resource "aws_eks_node_group" "techNode" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-east-1:019248244455:nodegroup/tech/techNode/a4c905b6-36df-f5a3-ec27-63f6c4c5aeb7" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "tech" -> null
      - disk_size              = 20 -> null
      - id                     = "tech:techNode" -> null
      - instance_types         = [
          - "t3.small",
        ] -> null
      - node_group_name        = "techNode" -> null
      - node_role_arn          = "arn:aws:iam::019248244455:role/LabRole" -> null
      - release_version        = "1.30.2-20240910" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-techNode-a4c905b6-36df-f5a3-ec27-63f6c4c5aeb7"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "ACTIVE" -> null
      - subnet_ids             = [
          - "subnet-01d3059e23aa6d6d7",
          - "subnet-023821714e99975f0",
          - "subnet-04a1a10cbf10df2bb",
          - "subnet-057bd241945828c79",
          - "subnet-067058a4f0e40dbdd",
        ] -> null
      - tags_all               = {} -> null
      - version                = "1.30" -> null
        # (1 unchanged attribute hidden)

      - scaling_config {
          - desired_size = 1 -> null
          - max_size     = 1 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - endpoint                              = "https://B453925D5B10C5E4DA8B23A7CC148248.gr7.us-east-1.eks.amazonaws.com" -> null
  - kubeconfig-certificate-authority-data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJUm5EWmtpdHNkbkl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1Ua3hOelEzTWpCYUZ3MHpOREE1TVRjeE56VXlNakJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUREekNDejg2M0g4MG1FaU0vbURTVEhKa0VxTTl4VTVTNzhqUXRqUThocDNxWk1tMndpbTNoZVFPZFIKdnltOGZMaFlWRE9UM1dzWUVwVWI0aTFraHZOZ3Q3dlYxcDAwZUVNUERSOGdFRDlBYzh4THhBM1lpZDRpaGhaMwpIWWxHRHBYMTFKYVA1ZEtBT0RqWjh4RmxKM1VLSHNXTVZRdnlsYVRTRlRHcjE2ZHZhZ0tQc1pYWFB5TTIwZWp5ClZCLzJhMDZRL3JiaFpOSjNpQjU1QVlmT2FMVU9lM2pkREZmZWh1eVJUeGxVdEEwUEJuMDJuVjFHQVVrZEd4RVoKcmxmYkcrakljRmRFYkxJTm5iVXJMSVBmZDhHMDIrWWpWeTFVTEFycStZdFVvRWpzQ2VkRlFTNndhZjVJbENVRAovVFNSdmcvWlNCUDBzWTEvZlA3OHpRNW1BZldiQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUeFhSQXlhSlpsVC9UR25IbmZoQWdNMHFPUEpUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUF3SEg5dmNiWgpYMUw5V0VGTHdZSndjMkxPZlQ0eWxoZG1jcktEQ2Z3MFgrdk1FbnlDQVh6VXZjZU0vMEs2dXd3Z2xiSmJsQTN5CjRwb1d5dDF0Sk5Lek8wWllPZ3kycENlcndwUXc5ZG5wNXJMM0xVUm1QU2IvVE5Ua2RWdG1CU0F0WnVrRkJteVoKcmZZWFB3bnYyckhXSjhsRFhXNnR4UzdqOThIWmk2VUVPNm1oakVGMlFuMmdBNUhsQ3c2MmJVQ2ZSTE55RFVlOAprV2d2Y0t5RUV4UFNOalg2c0hrY0VjaHRBTUhxa3ljczhpN2ozcm9ySTZvZTR0bFdWNEVOdEl2R2lsbC9xTXljCjNCTk9yVXpjQVFNdGxOWnpXZnV0SlR0aVkxNk1JWWwrY01hYUVCOHRIc1M1ZXk0VENsdWdlQXVkOG1wOEtZaG8KUFFtOUwrc2xLeDQrCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*